import clsx from 'clsx'
import { NextPage } from 'next'
import { NextSeo } from 'next-seo'
import { DocumentLayout } from '../layouts/document'
import { ContentWrapper } from '../layouts/document/components/ContentWrap'
import { SectionTitle } from '../layouts/document/components/SectionTitle'

const Page: NextPage = () => {
  return (
    <DocumentLayout>
      <NextSeo title="นโยบายคุ้มครองข้อมูลส่วนบุคคล" />
      <div className="mb-20">
        <SectionTitle
          title="PRIVACY POLICY"
          subtitle="นโยบายคุ้มครองข้อมูลส่วนบุคคล"
        />
        <ContentWrapper>
          <h2>ข้อมูลส่วนบุคคล คืออะไร?</h2>
          <p>
            ข้อมูลส่วนบุคคล หมายถึง
            ข้อมูลเกี่ยวกับบุคคลซึ่งทำให้สามารถระบุตัวตนบุคคลนั้นได้
            ไม่ว่าทางตรงหรือทางอ้อม แต่ไม่รวมถึงข้อมูลของผู้ถึงแก่กรรมโดยเฉพาะ
          </p>

          <h2>ลักษณะข้อมูลส่วนบุคคลที่เราเก็บรวบรวม</h2>
          <ul>
            เราจะเก็บรวบรวมข้อมูลส่วนบุคคลดังต่อไปนี้
            <li>ข้อมูลที่บ่งชี้ตัวตน อาทิ ชื่อ วันเกิด อายุ สัญชาติ</li>
            <li>
              ข้อมูลช่องทางการติดต่อ อาทิ ที่อยู่ สถานที่ติดต่อ เบอร์โทร อีเมล
            </li>
            <li>ข้อมูลบัญชี อาทิ รายละเอียดการชำระเงิน</li>
            <li>
              ข้อมูลส่วนตัว อาทิ ชื่อบัญชีผู้ใช้
              ความสนใจของท่านที่มีต่อบริการต่าง ๆ ของผู้ให้บริการ
            </li>
            <li>
              ข้อมูลทางเทคนิค อาทิ Google Analytics, Facebook Pixels, Hotjar
              หมายเลขระบุตำแหน่งคอมพิวเตอร์ (IP Address) ข้อมูลการเข้าระบบ
              ข้อมูลการใช้งาน และ การตั้งค่า (log)
            </li>
          </ul>

          <h2>แหล่งที่มาของข้อมูลส่วนบุคคล</h2>
          <ul>
            เราได้รับข้อมูลส่วนบุคคลของท่านจาก 2 ช่องทาง ดังนี้
            <li>
              เราได้รับข้อมูลส่วนบุคคลจากท่านโดยตรง
              โดยเราจะเก็บรวบรวมข้อมูลส่วนบุคคลของท่านจากการยินยอมเข้าร่วมโครงการ
              ดังนี้
            </li>
            <ol>
              <li>เมื่อท่านลงทะเบียนบัญชีเพื่อเข้าร่วมโครงการ</li>
              <li>เมื่อท่านยินยอมรับข้อมูลข่าวสารจากสมาคมผู้ดูแลเว็บไทย</li>
              <li>จากการเก็บข้อมูลการใช้เว็บไซต์ของท่านผ่านบราวเซอร์คุกกี้</li>
              <li>
                จากการติดต่อสอบถามของท่าน หรือผ่านการโต้ตอบทางอีเมลหรือ
                ช่องทางการสื่อสารอื่น ๆ เช่น โทรศัพท์
                เพื่อที่ผู้ให้บริการสามารถติดต่อท่านกลับได้
              </li>
              <li>
                เมื่อท่านเข้าสู่ระบบบัญชีผู้ใช้บนเว็บไซต์ของเรา
                หรือแอพพลิเคชันอื่น ๆ ที่เกี่ยวข้อง อาทิ เฟสบุ๊ค
              </li>
            </ol>
            <li>
              เราได้รับข้อมูลส่วนบุคคลของท่านมาจากบุคคลที่สาม Facebook Login
              โดยได้รับข้อมูลเมื่อท่านสมัครระบบหรือเข้าใช้งานระบบผ่านช่องทางของบุคคลที่สาม
            </li>
          </ul>

          <h2>วัตถุประสงค์ในการประมวลผลข้อมูล</h2>
          <ul>
            <li>
              เราจัดเก็บข้อมูลส่วนบุคคลของท่านเพื่อประโยชน์ในการจัดฐานข้อมูลในการวิเคราะห์
              และเสนอสิทธิประโยชน์ตามความสนใจของท่าน
            </li>
            <li>
              เราจัดเก็บข้อมูลส่วนบุคคลเพื่อยืนยันตัวตนว่าท่านเป็นผู้เดียวในการเข้าถึงบัญชีของท่าน
            </li>
            <li>
              เราจัดเก็บข้อมูลส่วนบุคคลของท่านเพื่อวิจัยการตลาดและบริหารความสัมพันธ์ระหว่างผู้
              ให้บริการและผู้ใช้บริการ
            </li>
            <li>
              เราจัดเก็บข้อมูลส่วนบุคคลของท่านเพื่อปฏิบัติตามข้อกฎหมาย
              และระเบียบบังคับใช้ของรัฐ
            </li>
            <li>
              เราจัดเก็บข้อมูลส่วนบุคคลของท่านเพื่อปฏิบัติตามกฎระเบียบที่ใช้บังคับกับผู้บริการ
              รวมถึงการยินยอมให้ผู้ให้บริการสามารถโอนข้อมูลส่วนบุคคลให้แก่กลุ่มธุรกิจและพันธมิตรของผู้ให้บริการ
              ผู้ประมวลผลข้อมูล หรือหน่วยงานใด ๆ ที่มีสัญญากับผู้ให้บริการ
            </li>
          </ul>

          <h2>การประมวลผลข้อมูลส่วนบุคคล</h2>
          <ul>
            เมื่อได้รับข้อมูลส่วนบุคคลจากท่านแล้ว เราจะดำเนินการดังนี้
            <li>
              เก็บรวบรวมโดยมีการบันทึกในระบบคอมพิวเตอร์ ที่ใช้บริการ ได้แก่
              MongoDB Atlas, Google Cloud Platform, Firebase, Airtable
            </li>
            <li>
              เราจะใช้ข้อมูลส่วนบุคคลของท่านที่ได้เก็บรวบรวมมาในการดำเนินของสมาคมตามวัตถุประสงค์ที่ระบุไว้ในหัวข้อ
              “วัตถุประสงค์ในการประมวลผลข้อมูล”
            </li>
          </ul>

          <h2>การแบ่งปันข้อมูล</h2>
          <p>
            เราใช้ผู้ให้บริการภายนอกเพื่อดำเนินการกับข้อมูลส่วนบุคคลของท่านในนามของเราเท่านั้น
            การดำเนินการนี้เพื่อจุดประสงค์ที่ระบุไว้ในแถลงการณ์ความเป็นส่วนตัวนี้
            ยกตัวอย่างเช่น การเก็บสถิติการใช้งาน การวิเคราะห์
            หรือส่งข้อมูลการตลาด
            ผู้ให้บริการเหล่านี้มีภาระผูกพันตามข้อตกลงการรักษาความลับและไม่ได้รับอนุญาตให้ใช้ข้อมูลส่วนบุคคลของท่านเพื่อจุดประสงค์ของผู้ดำเนินการเองหรือเพื่อจุดประสงค์อื่น
          </p>

          <h2>การเก็บรักษาและระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล</h2>

          <ul>
            <b>การเก็บรักษาข้อมูลส่วนบุคคล</b>
            ผู้ควบคุมทำการเก็บรักษาข้อมูลส่วนบุคคลของท่าน ดังนี้
            <li>
              ข้อมูลส่วนบุคคลที่ทางสมาคมจัดเก็บจะอยู่ในลักษณะของ Hard Copy และ
              Soft Copy
            </li>
            <li>
              ข้อมูลส่วนบุคคลจะถูกจัดเก็บไว้ในเครื่องมืออุปกรณ์ของคณะดำเนินงานภายใต้การดูแลของสมาคมผู้ดูแลเว็บไทย
              ได้แก่ คอมพิวเตอร์ โทรศัพท์มือถือ
              รวมถึงมีการเก็บข้อมูลในบนระบบคอมพิวเตอร์ ซึ่งได้แก่ MongoDB Atlas,
              Google Cloud Platform, Firebase
            </li>
            <li>
              ระยะเวลาจัดเก็บ เป็นไปตามหัวข้อ
              &quot;ระยะเวลาในการประมวลผลข้อมูลส่วนบุคคล&quot;
            </li>
          </ul>

          <h2>Data Retention Period</h2>

          <table className="w-full table-auto">
            <thead className="bg-gray-300">
              <th className="w-2/12 border px-5 py-3 text-center lg:w-1/12">
                ลำดับที่
              </th>
              <th className="w-auto border px-5 py-3 text-center">
                ประเภท / รายการข้อมูลส่วนบุคคล
              </th>
              <th className="w-3/12 border px-5 py-3 text-center lg:w-2/12">
                ระยะเวลาประมวลผล
              </th>
            </thead>
            <tbody>
              {[
                [
                  1,
                  'ข้อมูลที่บ่งชี้ตัวตน อาทิ ชื่อ อายุ สัญชาติ วันเกิด อายุ',
                  '1 ปี',
                ],
                [
                  2,
                  'ข้อมูลช่องทางการติดต่อ อาทิ ที่อยู่ สถานที่ติดต่อ เบอร์โทร อีเมล',
                  '1 ปี',
                ],
                [
                  3,
                  'ข้อมูลบัญชี อาทิ รายละเอียดการชำระเงิน และบัญชีธนาคาร',
                  '1 ปี',
                ],
                [
                  4,
                  'ข้อมูลทางธุรกรรม อาทิ ประวัติการรับบริการต่าง ๆ ประวัติการซื้อขาย',
                  '1 ปี',
                ],
                [
                  5,
                  'ข้อมูลส่วนตัว อาทิ ชื่อบัญชีผู้ใช้ รหัสผ่าน การสั่งซื้อ ความสนใจของท่านที่มีต่อบริการต่างๆของผู้ให้บริการ',
                  '1 ปี',
                ],
                [
                  6,
                  'ข้อมูลทางการตลาด อาทิ ความพึงพอใจของท่านต่อบริการที่ได้รับ และความเห็นต่อการให้บริการของบุคลากร',
                  '1 ปี',
                ],
              ].map((item, index) => (
                <tr key={index} className="hover:bg-gray-100">
                  {item.map((itemDetail, i) => (
                    <td
                      className={clsx(
                        'border px-5 py-3',
                        i === 0 || i === 2 ? 'text-center' : null
                      )}
                      key={`${index}-${i}`}
                    >
                      {itemDetail}
                    </td>
                  ))}
                </tr>
              ))}
            </tbody>
          </table>

          <h2>สิทธิของเจ้าของข้อมูล</h2>
          <ul>
            ท่านมีสิทธิในการดำเนินการ ดังต่อไปนี้
            <li>
              สิทธิในการได้รับแจ้ง (right to be informed):
              ท่านมีสิทธิที่จะได้รับแจ้งเมื่อข้อมูลส่วนบุคคลของท่านถูกจัดเก็บ
              รวมถึงรายละเอียดต่าง ๆ ที่เกี่ยวข้อง อาทิ
              วิธีการจัดเก็บและระยะเวลาการจัดเก็บ
            </li>
            <li>
              สิทธิในการเพิกถอนความยินยอม (right to withdraw consent):
              ท่านมีสิทธิในการเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคลที่ท่านได้ให้ความยินยอมกับเราได้
              ตลอดระยะเวลาที่ข้อมูลส่วนบุคคลของท่านอยู่กับเรา
            </li>
            <li>
              สิทธิในการเข้าถึงข้อมูลส่วนบุคคล (right of access):
              ท่านมีสิทธิในการเข้าถึงข้อมูลส่วนบุคคลของท่านและขอให้เราทำสำเนาข้อมูลส่วนบุคคลดังกล่าวให้แก่ท่าน
              รวมถึงขอให้เราเปิดเผยการได้มาซึ่งข้อมูลส่วนบุคคลที่ท่านไม่ได้ให้ความยินยอมต่อเรา
            </li>
            <li>
              สิทธิในการแก้ไขข้อมูลผู้สมัครให้ถูกต้อง (right to rectification):
              ท่านมีสิทธิในการขอให้เราแก้ไขข้อมูลที่ไม่ถูกต้องหรือเพิ่มเติมข้อมูลที่ไม่สมบูรณ์
            </li>
            <li>
              สิทธิในการลบข้อมูลส่วนบุคคล (right to erasure):
              ท่านมีสิทธิในการขอให้เราทำการลบข้อมูลของท่านด้วยเหตุบางประการได้
            </li>
            <li>
              สิทธิในการระงับการใช้ข้อมูลส่วนบุคคล (right to restriction of
              processing):
              ท่านมีสิทธิในการระงับการใช้ข้อมูลส่วนบุคคลของท่านด้วยเหตุบางประการได้
            </li>
            <li>
              สิทธิในการให้โอนย้ายข้อมูลส่วนบุคคล (right to data portability):
              ท่านมีสิทธิในการโอนย้ายข้อมูลส่วนบุคคลของท่านไปให้แก่ผู้ควบคุมข้อมูลรายอื่นหรือตัวท่านเองด้วยเหตุบางประการได้
            </li>
            <li>
              สิทธิในการคัดค้านการประมวลผลข้อมูลส่วนบุคคล (right to object):
              ท่านมีสิทธิในการคัดค้านการประมวลผลข้อมูลส่วนบุคคลของท่านด้วยเหตุบางประการได้
            </li>
          </ul>
          <p>
            ท่านสามารถติดต่อมายังเจ้าหน้าที่ DPO
            หรือเจ้าหน้าที่ฝ่ายควบคุมข้อมูลของเราได้
            เพื่อดำเนินการยื่นคำร้องขอดำเนินการตามสิทธิข้างต้นได้
            (รายละเอียดการติดต่อปรากฏในหัวข้อ “ช่องทางการติดต่อ” ด้านล่างนี้)
            หรือ ท่านสามารถศึกษารายละเอียดเงื่อนไข ข้อยกเว้นการใช้สิทธิต่าง ๆ
            ได้ที่ แนวปฏิบัติเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคล (TDPG2.0) และ
            เว็บไซต์กระทรวงดิจิทัลเพื่อเศรษฐกิจและสังคม{' '}
            <a href="http://www.mdes.go.th">http://www.mdes.go.th</a>
          </p>
          <p>
            ทั้งนี้ ท่านไม่จำเป็นต้องเสียค่าใช้จ่ายใด ๆ
            ในการดำเนินตามสิทธิข้างต้น โดยเราจะพิจารณา
            และแจ้งผลการพิจารณาคำร้องของท่านภายใน 30
            วันนับแต่วันที่เราได้รับคำร้องขอดังกล่าว
          </p>

          <h2>การยื่นคำร้องเพื่อการจัดการข้อมูลส่วนบุคคล</h2>
          <p>
            หากท่านมีความประสงค์ในการยื่นคำร้องเรียนเพื่อจัดการข้อมูลส่วนบุคคลของท่าน
            ซึ่งรวมไปถึงการขอเข้าถึงข้อมูลส่วนบุคคล การแก้ไขข้อมูลส่วนบุคคล
            การขอเพิกถอนการยินยอมให้ข้อมูลส่วนบุคคล
            และการส่งความคิดเห็นต่อการบริการ
            ท่านสามารถติดต่อได้ทางเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลตามรายละเอียดในหัวข้อ
            “ช่องทางการติดต่อ”
          </p>

          <h2>กิจกรรมส่งเสริมการตลาด</h2>
          <p>
            ในระหว่างการใช้บริการ
            เราจะส่งข้อมูลข่าวสารเกี่ยวกับกิจกรรมทางการตลาด และการส่งเสริม
            การตลาด ผลิตภัณฑ์ การให้บริการ
            ที่เราคิดว่าท่านอาจสนใจเพื่อประโยชน์ในการให้บริการกับ
            ท่านอย่างเต็มประสิทธิภาพ
            หากท่านได้ตกลงที่จะรับข้อมูลข่าวสารดังกล่าวจากเราแล้ว ท่านมีสิทธิ
            ยกเลิกความยินยอมดังกล่าวได้ทุกเมื่อ
            โดยท่านสามารดำเนินการยกเลิกความยินยอมในการรับแจ้งข้อมูล
            ข่าวสารได้โดยสามารถติดต่อมาได้ผ่านทางที่อยู่อีเมล{' '}
            <a href="mailto:ywc@webmaster.or.th">ywc@webmaster.or.th</a>
          </p>
        </ContentWrapper>
      </div>
      <div>
        <SectionTitle title="COOKIE POLICY" subtitle="นโยบายคุกกี้" />
        <ContentWrapper>
          <h2>Cookies คืออะไร ?</h2>
          <p>
            Cookies คือ text files ที่อยู่ในคอมพิวเตอร์ของท่าน
            ใช้เพื่อจัดเก็บรายละเอียดข้อมูล log การใช้งานอินเตอร์เน็ตของท่าน
            หรือ พฤติกรรมการเยี่ยมชมเว็บไซต์ของท่าน ท่านสามารถศึกษารายละเอียด
            เพิ่มเติมของ Cookies ได้จาก{' '}
            <a href="https://www.allaboutcookies.org/">
              https://www.allaboutcookies.org/
            </a>
          </p>
          <h2>เราใช้ Cookies อย่างไร ?</h2>
          <p>
            เราจะจัดเก็บข้อมูลการเข้าเยี่ยมชมเว็บไซต์จากผู้เข้าเยี่ยมชมทุกรายผ่าน
            Cookies หรือ เทคโนโลยีที่ใกล้เคียง และเราใช้ Cookies
            เพื่อประโยชน์ในการพัฒนาประสิทธิภาพในการเข้าถึงบริการของเราผ่านระบบอินเตอร์เน็ต
            รวมถึงพัฒนาประสิทธิภาพในการใช้งานเว็บไซต์ โดยจะใช้เพื่อกรณี
            ดังต่อไปนี้
          </p>
          <ul>
            <li>
              เพื่อให้ท่านสามารถเข้าสู่ระบบบัญชีของท่านในเว็บไซต์ของเราได้อย่างต่อเนื่อง
              และปลอดภัย
            </li>
            <li>
              เพื่อศึกษาพฤติกรรมการใช้งานและเยี่ยมชมเว็บไซต์ของท่าน
              เพื่อปรับเนื้อหาให้ตรงกับความสนใจ
              และสามารถตอบสนองความต้องการของท่านมากขึ้น
            </li>
            <li>
              เพื่อศึกษาพฤติกรรมของผู้เยี่ยมชมเว็บไซต์โดยรวม
              และนำไปพัฒนาให้สามารถใช้งานได้ง่าย รวดเร็ว
              และมีประสิทธิภาพยิ่งขึ้น
            </li>
          </ul>

          <h2>ประเภทของ Cookies ที่เราใช้</h2>
          <ul>
            เว็บไซต์ของเราประกอบไปด้วย Cookies ดังต่อไปนี้
            <li>
              Functionality Cookies: คุกกี้ประกอบการทำงานของเว็บไซต์
              ถูกใช้ในการจดจำสิ่งที่ท่านเลือกหรือตั้งค่าบนเว็บไซต์
              รวมถึงการนำเสนอข้อมูลที่ตรงความต้องการ เฉพาะบุคคลมากขึ้น เช่น
              ชื่อบัญชีผู้ใช้ ภาษา ฟ้อนต์ และรูปแบบเว็บไซต์
            </li>
            <li>
              Advertising Cookies: คุกกี้สำหรับการโฆษณา
              ใช้ในการจดจำสิ่งที่ท่านเคยเยี่ยมชมและรวมถึงลักษณะการใช้เว็บไซต์ของท่าน
              เพื่อนำเสนอสินค้า บริการ หรือ
              สื่อโฆษณาที่เกี่ยวข้องและตรงกับความสนใจของท่าน
              และใช้เพื่อการประเมินประสิทธิผลของแคมเปญโฆษณาต่าง ๆ
            </li>
            <li>
              Strictly Necessary Cookies: คุกกี้ทางเทคนิค
              เป็นประเภทคุกกี้ที่มีความจำเป็นต่อการใช้งานเว็บไซต์ทำให้ท่านสามารถเข้าถึงข้อมูลได้อย่างทั่วถึงและปลอดภัย
            </li>
            <li>
              Performance Cookies: คุกกี้เพื่อวัดผลการทำงานของเว็บไซต์
              คุกกี้ประเภทนี้จะจัดเก็บข้อมูลของผู้เข้าชมเว็บไซต์แบบไม่ระบุตัวตน
              และนำมาวิเคราะห์จำนวนและพฤติกรรมของผู้เข้าชม
              เพื่อปรับปรุงเว็บไซต์ให้มีประสิทธิภาพและตรงกับความต้องการของผู้ใช้มากขึ้น
            </li>
            <li>
              Third-party Cookies: คุกกี้บุคคลที่สาม
              คุกกี้ชนิดนี้จะถูกกำหนดใช้โดยผู้บริการซึ่งเป็นบุคคลที่สาม อาทิ
              Google Analytics, Facebook Pixels, Hotjar
            </li>
          </ul>

          <h2>การตั้งค่าคุกกี้</h2>
          <ul>
            ท่านสามารถตั้งค่าเพื่อปฏิเสธการใช้การคุกกี้ในบราวเซอร์ของท่านได้
            โดยมีขั้นตอนในการจัดการดังนี้:
            <br />
            <span>สำหรับผู้ใช้ระบบซาฟารี (Safari)</span>
            <ul>
              <li>เข้าแอพพลิเคชั่นซาฟารีและเลือก “การตั้งค่า”</li>
              <li>
                เลือก “ความเป็นส่วนตัว”
                และจัดการข้อมูลการใช้คุกกี้ตามความต้องการของท่านดังนี้
              </li>
              <ol>
                <li>
                  เลือก “ป้องกันไม่ให้ติดตามข้ามไซต์”
                  เพื่อยกเลิกตัวติดตามใช้คุกกี้และข้อมูลเว็บไซต์
                </li>
                <li>
                  เลือก “ปิดกั้นคุกกี้ทั้งหมด”
                  เพื่อปิดกั้นไม่ให้เว็บไซต์บุคคลที่สามและผู้โฆษณาจัดเก็บข้อมูลต่าง
                  ๆ ไว้บนเครื่องคอมพิวเตอร์ของคุณ
                </li>
                <li>
                  เลือก “จัดการข้อมูลเว็บไซต์”
                  เพื่อดูว่าเว็บไซต์ใดบ้างที่จัดเก็บคุกกี้และข้อมูลของท่าน
                </li>
              </ol>
            </ul>
            <span>สำหรับผู้ใช้กูเกิ้ลโครม (Google Chrome)</span>
            <ul>
              <li>
                เข้าระบบกูเกิ้ลโครมในคอมพิวเตอร์ และเลือก “การตั้งค่า” ด้านขวาบน
              </li>
              <li>เลือก “ขั้นสูง” ด้านล่าง</li>
              <li>เลือก “การตั้งค่าและความปลอดภัย”</li>
              <li>เลือก “การตั้งค่าเว็บไซต์”</li>
              <li>คลิก “คุกกี้”</li>
              <li>
                หากต้องการยกเลิกการใช้คุกกี้ เลือก
                “ปิดการอนุญาตให้เว็บไซต์บันทึกและอ่านข้อมูลคุกกี้”
              </li>
            </ul>
            <span>สำหรับผู้ใช้ Internet Explorer</span>
            <ul>
              <li>เมื่อเข้าระบบ Internet Explorer เลือก “การตั้งค่า”</li>
              <li>หากต้องการลบข้อมูลคุกกี้:</li>
              <ol>
                <li>เลือก “ความปลอดภัย”</li>
                <li>เลือก “ลบประวัติการเรียกดู”</li>
                <li>เลือก “คุกกี้และข้อมูลเว็บไซต์” และกด “ลบ”</li>
              </ol>
              <li>หากต้องการลบข้อมูลคุกกี้:</li>
              <ol>
                <li>เลือก “เครื่องมือ”</li>
                <li>เลือก “ตัวเลือกอินเทอร์เน็ต”</li>
                <li>เลือก “ความเป็นส่วนตัว”</li>
                <li>กด “ขั้นสูง” และเลือกให้อนุญาตหรือบล็อกคุกกี้</li>
              </ol>
            </ul>
          </ul>

          <h2>นโยบายคุ้มครองข้อมูลส่วนบุคคลของเว็บไซต์อื่น</h2>
          <p>
            นโยบายความเป็นส่วนตัวฉบับนี้
            ใช้เฉพาะสำหรับการให้บริการของเราและการใช้งานเว็บไซต์ของเราเท่านั้น
            หากท่านได้กดลิงก์ไปยังเว็บไซต์อื่น
            แม้จะผ่านช่องทางในเว็บไซต์ของเราก็ตาม
            ท่านจะต้องศึกษาและปฏิบัติตามนโยบายความเป็นส่วนตัวที่ปรากฏในเว็บไซต์นั้น
            ๆ แยกจากของเว็บไซต์ของเราอย่างสิ้นเชิง
          </p>

          <h2>การเปลี่ยนแปลงนโยบายคุ้มครองข้อมูลส่วนบุคคล</h2>
          <p>
            เราจะทำการพิจารณาทบทวนนโยบายความเป็นส่วนตัวเป็นประจำเพื่อให้สอดคล้องกับแนวทางการปฏิบัติ
            และกฎหมายข้อบังคับที่เกี่ยวข้อง
            ทั้งนี้หากมีการเปลี่ยนแปลงนโยบายความเป็นส่วนตัว
            เราจะแจ้งให้ท่านทราบด้วยการปรับเปลี่ยนข้อมูลลงในเว็บไซต์ของเราโดยเร็วที่สุด
            ปัจจุบันนโยบายความเป็นส่วนตัวถูกทบทวนครั้งล่าสุดเมื่อ 04/09/2020
            และจะมีผลตั้งแต่วันที่ 07/09/2020
          </p>

          <h2>ช่องทางการติดต่อ</h2>
          <span>
            <b>Data Controller</b>
            <br />
            ชื่อ: สมาคมผู้ดูแลเว็บไทย
            <br />
            สถานที่ติดต่อ: อาคารอุตสาหกรรมซอฟต์แวร์ปาร์ค เลขที่ 99/23
            ถ.แจ้งวัฒนะ ต.คลองเกลือ อ.ปากเกร็ด จ.นนทบุรี 11120
          </span>
          <ul>
            <b>ช่องทางการติดต่อ:</b>
            <li>
              อีเมล:{' '}
              <a href="mailto:ywc@webmaster.or.th">ywc@webmaster.or.th</a>
            </li>
            <li>
              เว็บไซต์:{' '}
              <a href="https://webmaster.or.th">https://webmaster.or.th</a>
            </li>
          </ul>

          <h2>ข้อมูลส่วนบุคคลที่จะทำการประมวลผล</h2>
          <p>
            รายละเอียดปรากฏตามนโยบายคุ้มครองข้อมูลส่วนบุคคล หัวข้อ
            “ข้อมูลส่วนบุคคลที่เราเก็บรวบรวม” และ
            “ระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล”
            วัตถุประสงค์และฐานในการประมวลผลข้อมูล
            รายละเอียดปรากฏตามนโยบายคุ้มครองข้อมูลส่วนบุคคล หัวข้อ
            “วัตถุประสงค์ในการประมวลผลข้อมูล”
            เราดำเนินการประมวลผลข้อมูลส่วนบุคคลของท่านภายใต้ฐาน ดังต่อไปนี้
          </p>
          <ul>
            <li>
              ความยินยอม ตามที่ท่านได้ให้ความยินยอมเมื่อสมัครใช้บริการ
              ทั้งนี้หากท่านประสงค์จะถอนความยินยอม ท่านสามารถดำเนินการได้ดังนี้
              ท่านสามารถแจ้งเพิกถอนความยินยอมในการให้ใช้หรือเปิดเผยข้อมูลในวัตถุประสงค์หรือลักษณะใด
              ๆ ที่ได้ระบุไว้ข้างต้นได้ตลอดเวลา
              รวมถึงการร้องขอให้ลบหรือทำให้ข้อมูลส่วนบุคคลเป็นนิรนามได้
              โดยติดต่อเจ้าหน้าที่ป้องกันข้อมูลส่วนบุคคลซึ่งระบุเอาไว้ด้านบน
              แนวทางการถอนความยินยอมประกอบไปด้วย:
            </li>
            <ul>
              <li>ช่องทางอิเล็กทรอนิกส์ อาทิ อีเมล หรือ Facebook Fanpage</li>
              <li>แจ้งผ่านวาจา อาทิ โทรศัพท์ หรือ ต่อหน้าคณะผู้จัด</li>
            </ul>
          </ul>
          <p>
            โดยเมื่อคณะผู้จัดได้รับคำร้องของท่านแล้ว
            จะทำการส่งต่อให้แก่ฝ่ายบริหารจัดการข้อมูลเพื่อดำเนินการในขั้นตอนต่อไป
            ทั้งนี้การถอนความยินยอมจะไม่ส่งผลกระทบต่อการประมวลผลข้อมูลส่วนบุคคลที่ท่านได้ให้ความยินยอมไปแล้วโดยชอบด้วยกฎหมาย
            นอกจากนี้ผลกระทบจากการถอนความยินยอม มีดังนี้
          </p>
          <p>
            หากท่านได้แจ้งเพิกถอนความยินยอมในการให้ใช้หรือเปิดเผยข้อมูลส่วนบุคคล
            ทางบริษัทอาจไม่สามารถให้บริการหรือดำเนินการซื้อขายสินค้าแก่ท่าน
            บริษัทมีสิทธิตามกฎหมายและขอสงวนไว้ซึ่งสิทธิดังกล่าว
          </p>
          <p>
            ทั้งนี้ทางผู้ให้บริการไม่สามารถเก็บข้อมูลส่วนบุคคลของท่านหากไม่ได้รับการยินยอม
            เว้นแต่เพื่อวัตถุประสงค์ต่อไปนี้
          </p>
          <ul>
            <li>
              เพื่อผลประโยชน์สำคัญจำเป็น เพื่อระงับหรือป้องกันอันตรายต่อชีวิต
              สุขภาพ หรือร่างกายของบุคคล
            </li>
            <li>
              เพื่อจัดทำเอกสารทางประวัติศาสตร์ จดหมายเหตุ การวิจัยหรือสถิติ
            </li>
            <li>
              เพื่อการปฎิบัติตามพันธะสัญญาซึ่งเจ้าของข้อมูลส่วนบุคคลเป็นคู่สัญญา
            </li>
            <li>
              เพื่อดำเนินงานตามระเบียบหรือกฎหมายของภาครัฐ
              หรือการใช้อำนาจรัฐของผู้ควบคุมส่วนบุคคล
            </li>
            <li>
              เพื่อประโยชน์โดยชอบด้วยกฎหมายของผู้ให้บริการ
              ผู้ควบคุมข้อมูลส่วนบุคคล หรือนิติบุคคลอื่น
              เว้นแต้ประโยชน์ดังกล่าวมีความสำคัญน้อยกว่าสิทธิขั้นพื้นฐานในการให้ข้อมูลส่วนบุคคล
            </li>
            <li>เพื่อประโยชน์สาธารณะของผู้ควบคุมข้อมูลส่วนบุคคล</li>
          </ul>
          <h2>แหล่งที่มาของข้อมูลส่วนบุคคล</h2>
          <ul>
            เราได้รับข้อมูลส่วนบุคคลของท่าน จากกรณีดังนี้
            <li>
              เมื่อท่านได้เข้าถึงหรือใช้บริการเว็บไซต์ของเรา ลงทะเบียน
              หรือสมัครบัญชีผู้ใช้กับเรา
            </li>
            <li>
              เมื่อท่านส่งแบบฟอร์ม รวมถึงแบบฟอร์มการสมัครหรือแบบฟอร์มอื่น ๆ
              ที่เกี่ยวข้องกับโครงการของเรา
              ไม่ว่าจะเป็นรูปแบบออนไลน์หรือรูปแบบเอกสาร
            </li>
            <li>
              เมื่อท่านทำข้อตกลงใด ๆ
              หรือให้เอกสารหรือข้อมูลอื่นใดที่เกี่ยวข้องกับการติดต่อระหว่างท่านกับเรา
              หรือเมื่อท่านสมัครเข้าร่วมโครงการ ฯ กับเรา
            </li>
            <li>
              เมื่อท่านติดต่อกับเรา เช่น ผ่านทางโทรศัพท์ จดหมาย การประชุม
              การติดต่อผ่านเว็บไซต์สื่อทางสังคม และอีเมล
            </li>
            <li>
              เมื่อท่านใช้บริการเว็บไซต์ของเรา ซึ่งรวมถึงแต่ไม่จำกัดเพียง
              การใช้ผ่านคุกกี้ ซึ่งเราอาจปรับใช้เมื่อท่านได้เข้าถึงเว็บไซต์
            </li>
            <li>เมื่อท่านแสดงความคิดเห็นหรือส่งคำร้องเรียนแก่เรา</li>
            <li>เมื่อท่านลงทะเบียนเข้าร่วมเป็นผู้สมัครโครงการ ฯ</li>
            <li>เมื่อท่านเข้าเยี่ยมชมหรือใช้เว็บไซต์ของเรา</li>
            <li>เมื่อท่านเชื่อมต่อบัญชีของท่านกับเว็บไซต์ของเรา</li>
            <li>
              เมื่อท่านส่งข้อมูลส่วนบุคคลของท่านให้แก่เราด้วยเหตุผลใดก็ตาม
            </li>
          </ul>

          <h2>การประมวลผลข้อมูลส่วนบุคคล</h2>
          <p>
            รายละเอียดปรากฏตามนโยบายคุ้มครองข้อมูลส่วนบุคคล หัวข้อ
            “การประมวลผลข้อมูลส่วนบุคคล”
          </p>

          <h2>การเก็บรักษาข้อมูลส่วนบุคคล</h2>
          <p>
            รายละเอียดปรากฏตามนโยบายคุ้มครองข้อมูลส่วนบุคคล หัวข้อ
            “การเก็บรักษาข้อมูลส่วนบุคคล”
          </p>

          <h2>สิทธิของเจ้าของข้อมูล</h2>
          <p>
            รายละเอียดปรากฏตามนโยบายคุ้มครองข้อมูลส่วนบุคคล เรื่อง
            “สิทธิของเจ้าของข้อมูล”
          </p>
        </ContentWrapper>
      </div>
    </DocumentLayout>
  )
}

export default Page
