import { NextPage } from 'next'
import { NextSeo } from 'next-seo'
import Link from 'next/link'
import { DocumentLayout } from '../layouts/document'
import { ContentWrapper } from '../layouts/document/components/ContentWrap'
import { SectionTitle } from '../layouts/document/components/SectionTitle'

const Page: NextPage = () => {
  return (
    <DocumentLayout>
      <NextSeo title="ข้อกำหนดและเงื่อนไขการเข้าร่วมโครงการ" />
      <div>
        <SectionTitle
          title="Terms and Conditions"
          subtitle="ข้อกำหนดและเงื่อนไขการเข้าร่วมโครงการ"
        />
        <ContentWrapper>
          <h2>คุณสมบัติของผู้สมัครเข้าร่วมโครงการ</h2>
          <ol>
            <li>
              มีอายุระหว่าง 18 - 23 ปี โดยเกิดระหว่างวันที่ 1 มกราคม 2540 - 1
              มกราคม 2546
            </li>
            <li>ไม่จำกัดวุฒิการศึกษา สาขา คณะ ชั้นปี หรือตำแหน่งงาน</li>
            <li>
              ไม่อยู่ในกลุ่มเสี่ยงติดเชื้อ COVID-19
              ในช่วงก่อนวันสัมภาษณ์และวันจัดกิจกรรมตามเงื่อนไข ดังนี้
              <ul>
                <li>
                  ไม่มีอาการระบบทางเดินหายใจผิดปกติ เช่น ไอ น้ำมูก เจ็บคอ
                  หายใจเหนื่อย หรือหายใจลำบาก
                </li>
                <li>
                  ไม่ได้เดินทางหรืออาศัยอยู่ในพื้นที่ที่มีรายงานการติดเชื้อของโรค
                  COVID-19 ใน 14 วันที่ผ่านมา
                </li>
                <li>
                  ไม่มีประวัติสัมผัสกับผู้ป่วยที่ยืนยันถึงการเป็นโรคติดเชื้อไวรัส
                  COVID-19 เป็นเวลาอย่างน้อย 14
                  วันก่อนวันสัมภาษณ์และวันจัดกิจกรรม
                </li>
                <li>
                  ในสถานที่ที่ไปเป็นประจำ
                  ไม่มีการสัมผัสหรือมีปฏิสัมพันธ์กับคนที่มีอาการไข้ ไอ น้ำมูก
                  เสมหะ ในช่วงก่อนวันสัมภาษณ์และวันจัดกิจกรรม
                </li>
              </ul>
            </li>
            <li>
              ผู้สมัครจะต้องมีความสมัครใจ และสามารถเข้าร่วมกิจกรรมได้ตลอดโครงการ
              (ระยะเวลาโครงการ 4 วัน)
            </li>
          </ol>

          <h2>การสมัครเข้าร่วมโครงการ</h2>
          <ol>
            <li>
              สมัครได้ตั้งแต่วันที่ 14 กันยายน 2563 ถึงวันที่ 7 พฤศจิกายน 2563
              (ไม่มีค่าใช้จ่ายในการสม้คร)
            </li>
            <li>
              สาขาที่รับสมัครมีทั้งหมด 4 สาขา ได้แก่
              <ul>
                <li>Web Content</li>
                <li>Web Design</li>
                <li>Web Marketing</li>
                <li>Web Programming</li>
              </ul>
            </li>
            <li>
              ผู้สมัครสามารถสมัครได้เพียง 1 สาขาเท่านั้น
              โดยการเลือกสาขาจะอยู่ในขั้นตอนที่ 2 ของระบบรับสมัคร
              หากมีการยืนยันการเลือกสาขาและผ่านขั้นตอนที่ 2 แล้ว
              ผู้สมัครจะไม่สามารถเปลี่ยนสาขาได้อีก
            </li>
            <li>
              การสมัครจะเสร็จสมบูรณ์เมื่อผู้สมัครกดปุ่ม &quot;ส่งใบสมัคร&quot;
              ในขั้นตอนสุดท้ายแล้วเท่านั้น
              และเมื่อกดปุ่มแล้วจะไม่สามารถแก้ไขข้อมูลได้อีก
            </li>
            <li>
              ข้อมูลของผู้สมัครทุกคนจะถูกคุ้มครองตาม
              <Link href={'/policy'}>นโยบายคุ้มครองข้อมูลส่วนบุคคล</Link>
            </li>
          </ol>

          <h2>การคัดเลือกผู้เข้าร่วมโครงการ</h2>
          <ol>
            <li>
              ผู้สมัครจะผ่านการคัดเลือกโดยคณะกรรมการผู้ทรงคุณวุฒิ 2 รอบ ได้แก่
              <ol>
                <li>รอบตรวจใบสมัคร เพื่อคัดเลือกผู้มีสิทธิ์สัมภาษณ์</li>
                <li>รอบสัมภาษณ์ เพื่อคัดเลือกผู้มีสิทธิ์เข้าร่วมโครงการ</li>
              </ol>
            </li>
            <li>
              รายชื่อผู้มีสิทธิ์สัมภาษณ์จะประกาศที่เว็บไซต์{' '}
              <a href="https://www.ywc.in.th" target="_blank" rel="noreferrer">
                ywc.in.th
              </a>{' '}
              ในวันที่ 14 พฤศจิกายน 2563 พร้อมแจ้งรายละเอียดวัน เวลา
              และสถานที่สัมภาษณ์
              รวมทั้งสิ่งที่ผู้เข้าสัมภาษณ์ต้องเตรียมมาในวันสัมภาษณ์
            </li>
            <li>
              ผู้มีสิทธิ์สัมภาษณ์ทุกคนจะต้องมาสัมภาษณ์กับคณะกรรมการในวันที่ 21
              พฤศจิกายน 2563
              โดยรายละเอียดเกี่ยวกับการเข้ารับการสัมภาษณ์จะแจ้งให้ทราบในวันประกาศรายชื่อผู้มีสิทธิ์สัมภาษณ์
            </li>
            <li>
              คณะกรรมการจะคัดเลือกผู้มีสิทธิ์เข้าร่วมโครงการ 4 สาขา ๆ ละ 20 คน
              รวมทั้งสิ้น 80 คน โดยจะประกาศรายชื่อผู้ผ่านการคัดเลือกที่เว็บไซต์{' '}
              <a href="https://www.ywc.in.th" target="_blank" rel="noreferrer">
                ywc.in.th
              </a>{' '}
              ในวันที่ 25 พฤศจิกายน 2563
            </li>
            <li>การตัดสินของคณะกรรมการถือเป็นที่สิ้นสุด</li>
          </ol>

          <h2>รายละเอียดการเข้าร่วมโครงการ</h2>
          <ol>
            <li>
              ผู้มีสิทธิ์เข้าร่วมโครงการต้องโอนเงินค่ามัดจำเพื่อเป็นการยืนยันสิทธิ์จำนวน
              500 บาท
              ซึ่งเงินมัดจำนี้จะได้รับคืนในวันสุดท้ายของโครงการเมื่อท่านเข้าร่วมครบทุกกิจกรรมเท่านั้น
            </li>
            <li>
              โครงการนี้ไม่มีค่าใช้จ่ายใด ๆ ในการเข้าร่วมกิจกรรม
              รวมอาหารมื้อหลักและอาหารว่างตลอดโครงการ
            </li>
            <li>
              ผู้จัดงานขอสงวนสิทธิ์ในการเปลี่ยนแปลง
              แก้ไขรายละเอียดกิจกรรมในครั้งนี้ และ/หรือข้อกำหนดและเงื่อนไขต่าง ๆ
              ที่เกี่ยวข้องตามดุลพินิจของผู้จัดงาน โดยไม่ต้องแจ้งให้ทราบล่วงหน้า
            </li>
          </ol>
        </ContentWrapper>
      </div>
    </DocumentLayout>
  )
}

export default Page
